load-tests/virtual-thread-500-user.txt
adam@pop-os:~/IdeaProjects/TicketQueue/queue-service$ k6 run ../load-tests/flash-sale.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: ../load-tests/flash-sale.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 50s max duration (incl. graceful stop):
              * flash_sale: Up to 500 looping VUs for 20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......: 44706   2200.543281/s
    checks_succeeded...: 100.00% 44706 out of 44706
    checks_failed......: 0.00%   0 out of 44706

    ✓ status is 200 or 429

    HTTP
    http_req_duration..............: avg=169.94ms min=959µs  med=158.18ms max=885.15ms p(90)=207.24ms p(95)=595.23ms
      { expected_response:true }...: avg=169.94ms min=959µs  med=158.18ms max=885.15ms p(90)=207.24ms p(95)=595.23ms
    http_req_failed................: 0.00%  0 out of 44706
    http_reqs......................: 44706  2200.543281/s

    EXECUTION
    iteration_duration.............: avg=170.11ms min=1.02ms med=158.41ms max=885.29ms p(90)=207.67ms p(95)=595.55ms
    iterations.....................: 44706  2200.543281/s
    vus............................: 51     min=51         max=500
    vus_max........................: 500    min=500        max=500

    NETWORK
    data_received..................: 12 MB  606 kB/s
    data_sent......................: 7.9 MB 389 kB/s



running (20.3s), 000/500 VUs, 44706 complete and 0 interrupted iterations
flash_sale ✓ [======================================] 000/500 VUs  20s