load-tests/virtual-thread-result.txt
adam@pop-os:~/IdeaProjects/TicketQueue/queue-service$ k6 run ../load-tests/flash-sale.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: ../load-tests/flash-sale.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 50s max duration (incl. graceful stop):
              * flash_sale: Up to 2000 looping VUs for 20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......: 41075   2053.525096/s
    checks_succeeded...: 100.00% 41075 out of 41075
    checks_failed......: 0.00%   0 out of 41075

    ✓ status is 200 or 429

    HTTP
    http_req_duration..............: avg=748.34ms min=975.99µs med=725.02ms max=1.55s p(90)=1.21s p(95)=1.25s
      { expected_response:true }...: avg=748.34ms min=975.99µs med=725.02ms max=1.55s p(90)=1.21s p(95)=1.25s
    http_req_failed................: 0.00%  0 out of 41075
    http_reqs......................: 41075  2053.525096/s

    EXECUTION
    iteration_duration.............: avg=749.33ms min=1.04ms   med=726.48ms max=1.55s p(90)=1.21s p(95)=1.25s
    iterations.....................: 41075  2053.525096/s
    vus............................: 66     min=66         max=2000
    vus_max........................: 2000   min=2000       max=2000

    NETWORK
    data_received..................: 11 MB  565 kB/s
    data_sent......................: 7.3 MB 363 kB/s



running (20.0s), 0000/2000 VUs, 41075 complete and 0 interrupted iterations
flash_sale ✓ [======================================] 0000/2000 VUs  20s